############觀察值#################
ob<- data.frame(    # 將觀察值建構data frame 物件
  x1=c(6,-4,2,-4),  # 第一行行名與向量值
  x2=c(4,2,-1,-3),  # 第二行行名與向量值
  row.names=1:4)     # 列名為1~4 代表分群對象的4個object
############初算隨意分群###########################
means<-rbind(    # 計算初始分群(1,2)、(3,4)的平均值
  colMeans(ob[c(1,2),]),
  colMeans(ob[c(3,4),]))
print(means)     # 初始分群(1,2)和(3,4) 的平均數
sum((ob - means[c(1,1,2,2),])^2)  # 依方程式(3.1)計算WCSS

means<-rbind(    # 計算初始分群(1,3)、(2,4)的平均值
  colMeans(ob[c(1,3),]),
  colMeans(ob[c(2,4),]))
print(means)     # 初始分群(1,3)和(2,4) 的平均數
sum((ob - means[c(1,2,1,2),])^2)  # 依方程式(3.1)計算WCSS
############### end of 3_3#################

